[
  {
    "id": "maize_fall_armyworm",
    "name": "Fall Armyworm",
    "localName": "Chipfukuto (Shona)",
    "affectedCrop": "Maize",
    "symptoms": "Irregular holes in leaves, especially in the whorl (heart) of the plant. Look for frass (insect droppings that look like sawdust) inside the whorl. Young larvae cause windowing effect on leaves. Severe damage leaves plants looking ragged. Most destructive at vegetative stage.",
    "treatment": "1. Apply Emamectin Benzoate (e.g., Escort, Coragen) directly into the whorl. 2. For small farms, manually remove and destroy egg masses and young caterpillars. 3. Apply when larvae are small for best results. 4. Spray early morning or evening. 5. Neem-based products can help on small farms.",
    "prevention": "1. Plant early in the season to avoid peak pest periods. 2. Practice crop rotation. 3. Keep field edges clear of grass where adults lay eggs. 4. Encourage natural predators such as birds and parasitic wasps. 5. Use pheromone traps to monitor adult populations.",
    "severity": "HIGH"
  },
  {
    "id": "maize_stalk_borer",
    "name": "Maize Stalk Borer",
    "localName": "Gonyo reMhunga (Shona)",
    "affectedCrop": "Maize",
    "symptoms": "Dead heart in young plants — central shoot dies while outer leaves remain green. Holes in stem with frass or sawdust. Broken tassels. Tunnels inside the stalk when cut open. Weakened plants that fall over easily.",
    "treatment": "1. Apply carbofuran granules (Furadan) into the whorl at 2-4 weeks after planting. 2. Use Emamectin Benzoate foliar spray. 3. Destroy crop residues after harvest to kill pupae. 4. Biological control: Trichogramma wasps are natural parasitoids.",
    "prevention": "1. Plant as early as possible. 2. Remove and burn crop residues immediately after harvest. 3. Deep plowing exposes pupae to birds and sun. 4. Use resistant varieties where available.",
    "severity": "HIGH"
  },
  {
    "id": "maize_grey_leaf_spot",
    "name": "Grey Leaf Spot",
    "localName": "Chirwere cheMashizha (Shona)",
    "affectedCrop": "Maize",
    "symptoms": "Rectangular, pale brown to grey lesions running parallel to leaf veins. Lesions are limited by veins giving them a blocky appearance. Severe infection causes entire leaves to die. Very common in Zimbabwe's high rainfall areas and humid valleys.",
    "treatment": "1. Apply fungicides: Propiconazole, Tebuconazole, or Azoxystrobin. 2. Spray at first sign of disease before tasseling. 3. Repeat after 14 days if conditions remain humid.",
    "prevention": "1. Plant resistant hybrid varieties (e.g., SC403, DKC80-33 which have moderate resistance). 2. Practice crop rotation — avoid continuous maize. 3. Ensure good plant spacing for airflow. 4. Remove and plow under crop residues.",
    "severity": "HIGH"
  },
  {
    "id": "tomato_early_blight",
    "name": "Early Blight",
    "localName": "Chirwere cheDonje (Shona)",
    "affectedCrop": "Tomatoes",
    "symptoms": "Brown or black spots on older lower leaves first. Spots have concentric rings giving a target-board appearance. Yellow halo around spots. Affected leaves turn yellow and drop prematurely. Disease moves upward on the plant.",
    "treatment": "1. Remove and destroy infected leaves immediately. 2. Apply Mancozeb, Chlorothalonil, or Copper-based fungicides. 3. Spray every 7-10 days during wet weather. 4. Ensure coverage on undersides of leaves.",
    "prevention": "1. Use certified disease-free seeds. 2. Practice 2-3 year crop rotation. 3. Mulch around plants to prevent soil splash. 4. Water at the base, not overhead. 5. Maintain adequate plant spacing.",
    "severity": "MEDIUM"
  },
  {
    "id": "tomato_late_blight",
    "name": "Late Blight",
    "localName": "Chirwere cheDonje Guru (Shona)",
    "affectedCrop": "Tomatoes",
    "symptoms": "Water-soaked pale green to brown lesions on leaf edges and tips. White fuzzy fungal growth visible on leaf undersides in humid conditions. Rapid collapse of entire plant. Dark brown areas on stems. Fruits show brown greasy patches.",
    "treatment": "1. Apply Metalaxyl + Mancozeb (Ridomil Gold) or Cymoxanil + Mancozeb. 2. Spray every 5-7 days in wet conditions. 3. Remove and destroy severely infected plants away from field. 4. Copper fungicides provide some protective action.",
    "prevention": "1. Use resistant varieties. 2. Ensure good drainage — avoid waterlogged soil. 3. Avoid working in field when plants are wet. 4. Monitor weather — disease spreads rapidly in cool, wet nights.",
    "severity": "HIGH"
  },
  {
    "id": "bean_rust",
    "name": "Bean Rust",
    "localName": "Chirwere cheRuvara (Shona)",
    "affectedCrop": "Beans",
    "symptoms": "Small powdery reddish-brown pustules on undersides of leaves. Yellow spots on upper leaf surface corresponding to pustules below. Severely affected leaves turn yellow and drop. Pods can also be infected. Reduced yield.",
    "treatment": "1. Apply Mancozeb, Copper Oxychloride, Triadimefon, or Tebuconazole. 2. Spray at first sign and repeat every 10-14 days. 3. Remove badly infected plant material.",
    "prevention": "1. Use rust-resistant varieties. 2. Practice crop rotation (2 years). 3. Avoid overhead irrigation. 4. Ensure good plant spacing. 5. Remove volunteer bean plants.",
    "severity": "MEDIUM"
  },
  {
    "id": "potato_late_blight",
    "name": "Potato Late Blight",
    "localName": "Chirwere cheZviyo (Shona)",
    "affectedCrop": "Potatoes",
    "symptoms": "Dark water-soaked lesions on leaf edges and tips. Cream or white fungal growth on leaf undersides in humid conditions. Rapid browning and collapse of haulms. Brown rot in tubers with reddish-brown discoloration beneath the skin. Spreads very rapidly in cool wet conditions common in Zimbabwe's Eastern Highlands.",
    "treatment": "1. Apply Metalaxyl + Mancozeb (Ridomil Gold) or Copper fungicides preventively before symptoms appear. 2. Spray every 7 days in humid weather. 3. Remove and destroy infected haulms before harvest.",
    "prevention": "1. Plant certified disease-free seed tubers. 2. Use resistant varieties. 3. Hill up well to protect tubers. 4. Harvest during dry conditions. 5. Do not leave cull piles near fields.",
    "severity": "HIGH"
  },
  {
    "id": "cabbage_diamondback_moth",
    "name": "Diamondback Moth",
    "localName": "Nhunguru yeKabheji (Shona)",
    "affectedCrop": "Cabbage",
    "symptoms": "Small holes in leaves — window-paning effect where larvae eat from inside leaving a thin skin. Green larvae that wriggle actively when disturbed. Holes in outer and inner leaves. Severe damage can completely defoliate plants.",
    "treatment": "1. Rotate insecticides to prevent resistance: use Bt (Bacillus thuringiensis), Emamectin Benzoate, Chlorantraniliprole, or Spinosad. 2. Never rely on a single chemical. 3. Apply when larvae are young. 4. Spray undersides of leaves thoroughly.",
    "prevention": "1. Use fine mesh nets to exclude adults from seedlings. 2. Practice crop rotation with non-brassica crops. 3. Remove old brassica crops immediately after harvest. 4. Intercrop with non-host plants.",
    "severity": "HIGH"
  },
  {
    "id": "aphids_general",
    "name": "Aphids",
    "localName": "Nhunguru diki (Shona)",
    "affectedCrop": "All Crops",
    "symptoms": "Clusters of small soft-bodied insects (green, black, brown) on growing tips and undersides of leaves. Leaves curl, pucker, or become distorted. Sticky honeydew on leaves attracts ants and causes black sooty mould. Yellowing and stunted growth. Aphids transmit many plant viruses.",
    "treatment": "1. Spray with soapy water for small infestations. 2. Apply Dimethoate, Imidacloprid, or Pirimicarb. 3. Encourage natural predators — ladybirds and lacewings. 4. Reflective mulch can deter aphids.",
    "prevention": "1. Monitor crops regularly. 2. Remove heavily infested shoots. 3. Avoid excessive nitrogen fertilizer which encourages lush growth. 4. Use yellow sticky traps to monitor populations.",
    "severity": "MEDIUM"
  },
  {
    "id": "whitefly_general",
    "name": "Whiteflies",
    "localName": "Nhunguru chena (Shona)",
    "affectedCrop": "Tomatoes",
    "symptoms": "Tiny white insects that fly up in clouds when plants are disturbed. Eggs and nymphs on undersides of leaves. Sticky honeydew and sooty mould on leaf surfaces. Yellowing and reduced vigour. Important vectors of Tomato Yellow Leaf Curl Virus (TYLCV).",
    "treatment": "1. Apply Imidacloprid, Thiamethoxam, or Pyriproxyfen. 2. Use yellow sticky traps. 3. Spray undersides of leaves thoroughly. 4. Rotate chemicals to prevent resistance.",
    "prevention": "1. Use reflective silver mulch. 2. Use fine mesh screens in nurseries. 3. Remove and destroy heavily infested plants early. 4. Avoid planting near old tomato fields.",
    "severity": "HIGH"
  },
  {
    "id": "newcastle_disease",
    "name": "Newcastle Disease (Ndondo)",
    "localName": "Ndondo (Shona)",
    "affectedCrop": "Poultry",
    "symptoms": "Sudden death in unvaccinated birds. Respiratory distress — gasping, coughing, sneezing. Neurological signs — twisting of neck, paralysis of wings and legs, walking in circles. Green watery diarrhoea. Drop in egg production. Swelling of tissues around the eye and neck.",
    "treatment": "No specific cure. Supportive care only: 1. Ensure clean water and electrolytes. 2. Prevent secondary bacterial infections with antibiotics. 3. Cull severely affected birds humanely. 4. Report serious outbreaks to Agritex or DVS (Department of Veterinary Services).",
    "prevention": "1. VACCINATION is the only effective prevention. Vaccinate at day-old and at 14-21 days using La Sota or I-2 vaccine. 2. Strict biosecurity — control farm visitors. 3. Quarantine new birds for 14-21 days. 4. Proper disposal of dead birds by burning or deep burial.",
    "severity": "HIGH"
  },
  {
    "id": "gumboro_ibd",
    "name": "Gumboro Disease (IBD)",
    "localName": "Chirwere cheHuku (Shona)",
    "affectedCrop": "Poultry",
    "symptoms": "Sudden onset in birds 3-6 weeks old. Ruffled feathers, depression, reluctance to eat. White or watery diarrhoea. Pecking at their own vent. Dehydration and rapid weight loss. High mortality up to 30%. Birds may recover but have permanently suppressed immunity.",
    "treatment": "No specific treatment. 1. Provide ORS (oral rehydration salts) in drinking water. 2. Ensure good ventilation and comfortable temperature. 3. Administer vitamins A, D and E to support recovery. 4. Antibiotics to prevent secondary bacterial infections.",
    "prevention": "1. Vaccinate chicks at 10-14 days and again at 18-21 days with live IBD vaccine. 2. Strict biosecurity — the virus survives in the environment for months. 3. Thorough cleaning and disinfection between flocks using effective disinfectants.",
    "severity": "HIGH"
  },
  {
    "id": "coccidiosis",
    "name": "Coccidiosis",
    "localName": "Ropa mudhara (Shona)",
    "affectedCrop": "Poultry",
    "symptoms": "Bloody or watery diarrhoea — dark red or reddish-brown. Depression, huddling under heat source. Pale combs and wattles. Reduced feed and water intake. High mortality in young chicks aged 3-6 weeks. Droopy wings.",
    "treatment": "1. Treat with Amprolium (Amprol), Toltrazuril (Baycox), or Sulphonamides in drinking water. 2. Treat the entire flock, not just sick birds. 3. Improve litter management — wet litter is the main risk. 4. Provide vitamins K and A to support recovery.",
    "prevention": "1. Use medicated chick starter feeds containing anticoccidials. 2. Maintain dry litter — fix water leakages immediately. 3. Avoid overcrowding. 4. Good ventilation reduces moisture. 5. Rotate litter management practices.",
    "severity": "HIGH"
  },
  {
    "id": "groundnut_rosette",
    "name": "Groundnut Rosette Virus",
    "localName": "Chirwere cheDovi (Shona)",
    "affectedCrop": "Groundnuts",
    "symptoms": "Two types in Zimbabwe — green rosette (light mottling, slight stunting) and chlorotic rosette (bright yellow leaves, severe stunting). Leaves are small and bunched together. Plants may die early. Virus is spread by aphids. Major cause of yield loss in Zimbabwean groundnut crops.",
    "treatment": "There is no cure once a plant is infected. Remove and destroy infected plants immediately to reduce aphid spread. Control aphid vectors with Dimethoate or Imidacloprid.",
    "prevention": "1. Plant resistant varieties such as JCGV 97045 and RG 1. 2. Plant early in the season before aphid populations build up. 3. Control aphid vectors vigorously with insecticides. 4. Maintain a plant-free period of at least 3 months. 5. Avoid planting near old groundnut fields.",
    "severity": "HIGH"
  },
  {
    "id": "sorghum_shoot_fly",
    "name": "Sorghum Shoot Fly",
    "localName": "Nhunguru yeMhunga (Shona)",
    "affectedCrop": "Sorghum",
    "symptoms": "Dead hearts in seedlings — the central shoot dies and turns brown while side leaves remain green. Maggots visible inside the dead shoot if pulled out. Severe damage to young plants causes them to tiller excessively and reduce yield.",
    "treatment": "1. Pull out and destroy affected plants. 2. Apply systemic insecticides like Imidacloprid as seed dressing or Carbosulfan as granules. 3. Spray Dimethoate at seedling stage.",
    "prevention": "1. Plant early to avoid peak fly activity. 2. Use resistant varieties. 3. Destroy crop residues after harvest. 4. Maintain good field hygiene.",
    "severity": "MEDIUM"
  },
  {
    "id": "tobacco_blue_mould",
    "name": "Blue Mould (Tobacco)",
    "localName": "Chirwere cheFodya (Shona)",
    "affectedCrop": "Tobacco",
    "symptoms": "Yellow to pale green spots on upper leaf surface. Blue-grey fuzzy fungal growth on undersides of leaves. Affected leaves eventually turn brown and die. Spreads rapidly in cool humid conditions. Can destroy an entire crop in days if untreated.",
    "treatment": "1. Apply Metalaxyl-based fungicides (Ridomil) or Cymoxanil + Mancozeb immediately. 2. Remove and destroy heavily infected plants. 3. Spray preventively during high-risk weather periods.",
    "prevention": "1. Use resistant varieties recommended by TIMB (Tobacco Industry and Marketing Board). 2. Avoid overhead irrigation. 3. Ensure good ventilation in seedbeds. 4. Monitor weather alerts and spray before rain events in susceptible periods.",
    "severity": "HIGH"
  }
]
